"use strict";

// const sumOfMoney = prompt("Вкажіть суму вкладу");
// const duration = 2;
// const percentage = 0.05;
// let totalSumOfMoney = sumOfMoney * percentage * duration / 12;
// alert(`Сума нарахованих відсотків: ${totalSumOfMoney.toFixed(1)} грн. за ${duration} місяці.`)


// 2 && 0 && 3 - 0, оскільки && повертає перше хибне значення, або якщо всі значення вірні то останнє.

// 2 || 0 || 3 - 2, оскільки || повертає перше істинне значення, або якщо всі значення хибні то останнє.

// 2 && 0 || 3 - пріоритетність у && більша ніж у ||, тому спочатку виконається дія з &&, де обереться 0, як перше хибне значення, а потім у дії з || обереться 3, як перше істинне значення. 